{
    "Sidebar": {
        "welcome": "Welcome !",
        "lastupdate": "Updated on",
        "dark": "Dark",
        "light": "Light"
    },
    "Home": {
        "greeting": "Hello everyone",
        "iam": "I'm",
        "based": "Based in Yogyakarta, ID",
        "introduction": "Experienced Full-stack Developer",
        "passion": "I am passionate about creating seamless web experiences. Specializing in building efficient, scalable, and engaging web applications, I focus on delivering digital solutions that are not only functional but also visually appealing",
        "motto": "Bringing digital dreams to life",
        "collaboration": "Let's collaborate!",
        "freelance": "I'm open for freelance work. Don't hesitate to contact me if you want to work together.",
        "getInTouch": "Get in Touch",
        "getResume": "Get Resume",
        "share_title": "My Personal Website",
        "thank_you_message": "Thank you for visiting ! 😊 Feel free to share with your friends. 🎉",
        "share_link": "Share Link",
        "link_copied": "Link Copied!",
        "techstack": "Technologies Used"
    },
    "About": {
        "title": "About",
        "metaDesc": "Discover more about Dwi Wijaya, an experienced Fullstack Developer with skills in coding, UI/UX design, and app development. Let's get to know each other better!",
        "subtitle": "Get to know me a better and discover more beyond the resume.",
        "journeyTitle": "My Journey",
        "valuesTitle": "Values and Philosophy",
        "funTitle": "Fun Facts",
        "intro": "Hi, I'm Dwi Wijaya, a passionate full-stack web developer with a love for creating dynamic and user-friendly websites. With over 2 years of experience in the industry, I specialize in front-end development and have a keen eye for design and detail. My goal is to create pixel-perfect websites that not only meet the client's needs but also exceed their expectations.",
        "journey": "My career in web development began during my years at High School, where I majored in Software Engineering. My first job was at a small software house, where I learned the ropes of web development and discovered my passion for coding. Over the years, I have had the opportunity to work on numerous exciting projects. Each experience has contributed to my growth as a developer and has helped me hone my skills.",
        "values": "I believe in continuous learning and improvement. I am driven by a desire to create websites that are not only functional but also aesthetically pleasing. My work is guided by the principles of simplicity, usability, and accessibility. I strive to keep up with the latest trends and technologies in web development to ensure that my skills are always up to date.",
        "funfact": "I don't have any fun facts yet 😭."
    },
    "Services": {
        "title": "Services",
        "metaDesc": "Explore the specialized services Dwi Wijaya offers, from web development, app development, UI/UX, design to consulting. Tailored solutions to bring your digital vision to life.",
        "subtitle": "Learn about the specialized services I offer to clients."
    },
    "Contact": {
        "title": "Get in Touch",
        "metaDesc": "Reach out to Dwi Wijaya for potential collaborations or inquiries. Connect via social media or send a direct message.",
        "subtitle": "Reach out and start a conversation about potential collaborations or inquiries.",
        "findSocial": "Find me on social media",
        "orsendMsg": "Or send me a message",
        "name": "Name",
        "namePlaceholder": "Insert your name *",
        "mail": "Mail",
        "mailPlaceholder": "Insert your email *",
        "projectDesc": "Project Description",
        "descPlaceholder": "Write me your project description *",
        "sendMsg": "Send a Message"
    },
    "Guestbook": {
        "title": "Guestbook",
        "metaDesc": "Share your thoughts, suggestions, or questions in the guestbook. Let's keep the conversation going!",
        "subtitle": "Leave whatever you like to say, suggestions, questions or anything!"
    },
    "Blog": {
        "title": "Blog",
        "metaDesc": "Dive into articles on code, creativity, and learning by Dwi Wijaya. Insights and updates from a Full-stack Developer's journey.",
        "subtitle": "Exploring the world of code, creativity, and constant learning."
    },
    "Common": {
        "comingsoon": "Coming Soon ....",
        "back": "Back"
    },
    "Dashboard": {
        "title": "Dashboard",
        "metaDesc": "Explore the personal dashboard of Dwi Wijaya, showcasing page speed insights, GitHub contributions, and LeetCode progress.",
        "subtitle": "This is my personal website dashboard built with serverless function",
        "pagespeedSubtitle": "Page Speed Index by Google API",
        "githubSubtitle": "My contributions from last year on github.",
        "leetcodeSubtitle": "My LeetCode statistics progress and performance."
    },
    "Skillset": {
        "title": "Skillset",
        "metaDesc": "Discover Dwi Wijaya's technical skills, professional tools, and certificates that highlight his expertise in Full-stack development.",
        "subtitle": "Discover related my technical skills and professional tools.",
        "certificateTitle": "Certificates",
        "certificateSubtitle": "A showcase of my professional certificates."
    },
    "Experience": {
        "title": "Experience",
        "metaDesc": "Explore the professional background of Dwi Wijaya, highlighting key experiences and career achievements.",
        "subtitle": "Find out my professional background and valuable experiences."
    },
    "Portfolio": {
        "title": "Portfolio",
        "metaDesc": "Browse the portfolio of Dwi Wijaya, showcasing his latest projects and creative achievements in web development, app development, UI/UX design, Design and more.",
        "subtitle": "Explore my latest projects and creations."
    },
    "Privacy": {
        "title": "Privacy Policy",
        "metaDesc": "Understand the privacy practices of Dwi Wijaya's website, including data collection, usage, and security measures.",
        "subtitle": "This privacy policy explains how we collect, use, and protect your information.",
        "information_collected": "We collect information that you provide to us directly, such as your name and email address.",
        "usage": "We use this information to improve our services and communicate with you.",
        "security": "We take the security of your information seriously and implement measures to protect it.",
        "contact": "If you have any questions, please contact us at ",
        "subtitles": {
            "information_collected": "Information We Collect",
            "usage": "Usage of Information",
            "security": "Security of Your Information",
            "contact": "Contact Us"
        }
    },
    "Offline": {
        "title": "You're Offline",
        "metaDesc": "You are currently offline. Please check your internet connection and try again to access the website content.",
        "subtitle": "No internet connection detected.",
        "message": "It looks like you are currently offline. Please check your internet connection and try again.",
        "retry": "Try Again"
    }
}